
## Terraform plan for environment: `int`

**Commit:** a99d7ccda9db8164f608fb862bc7c20a5a800feb


**API version:** c5ba4e9
**CLI version:** da12d1b
**Selfserve version:** c5ba4e9
**Internal version:** c5ba4e9

### Plan summary

`119 to add, 0 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.aws_cloudwatch_log_group.this
module.service.aws_lb_listener_rule.this["api"]
module.service.aws_lb_listener_rule.this["internal"]
module.service.aws_lb_listener_rule.this["selfserve"]
module.service.aws_lb_target_group.this["api"]
module.service.aws_lb_target_group.this["internal"]
module.service.aws_lb_target_group.this["selfserve"]
module.service.aws_s3_bucket_policy.bucket_policy
module.service.module.acm.aws_acm_certificate.this[0]
module.service.module.acm.aws_acm_certificate_validation.this[0]
module.service.module.batch.aws_batch_compute_environment.this["fargate"]
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.batch.aws_batch_job_queue.this["default"]
module.service.module.batch.aws_batch_scheduling_policy.this["default"]
module.service.module.batch.aws_iam_instance_profile.instance[0]
module.service.module.batch.aws_iam_role.instance[0]
module.service.module.batch.aws_iam_role.service[0]
module.service.module.batch.aws_iam_role_policy_attachment.instance["arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"]
module.service.module.batch.aws_iam_role_policy_attachment.service["arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"]
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
module.service.module.cloudfront.aws_cloudfront_monitoring_subscription.this[0]
module.service.module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac"]
module.service.module.ecs_cluster["api"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_cluster["api"].aws_ecs_cluster.this[0]
module.service.module.ecs_cluster["api"].aws_iam_policy.task_exec[0]
module.service.module.ecs_cluster["api"].aws_iam_role.task_exec[0]
module.service.module.ecs_cluster["api"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_cluster["internal"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_cluster["internal"].aws_ecs_cluster.this[0]
module.service.module.ecs_cluster["internal"].aws_iam_policy.task_exec[0]
module.service.module.ecs_cluster["internal"].aws_iam_role.task_exec[0]
module.service.module.ecs_cluster["internal"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_cluster["selfserve"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_cluster["selfserve"].aws_ecs_cluster.this[0]
module.service.module.ecs_cluster["selfserve"].aws_iam_policy.task_exec[0]
module.service.module.ecs_cluster["selfserve"].aws_iam_role.task_exec[0]
module.service.module.ecs_cluster["selfserve"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["api"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["api"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["api"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["api"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["api"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["api"].aws_iam_role.tasks[0]
module.service.module.ecs_service["api"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["api"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["internal"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["internal"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["internal"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["internal"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["internal"].aws_iam_role.tasks[0]
module.service.module.ecs_service["internal"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["internal"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["selfserve"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["selfserve"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_iam_role.tasks[0]
module.service.module.ecs_service["selfserve"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["selfserve"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.log_bucket.aws_s3_bucket.this[0]
module.service.module.log_bucket.aws_s3_bucket_acl.this[0]
module.service.module.log_bucket.aws_s3_bucket_ownership_controls.this[0]
module.service.module.log_bucket.aws_s3_bucket_public_access_block.this[0]
module.service.module.records.aws_route53_record.this["cdn A"]
module.service.module.route53_records.aws_route53_record.validation[0]
module.service.module.ecs_service["api"].module.container_definition["api"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_service["internal"].module.container_definition["internal"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_service["selfserve"].module.container_definition["selfserve"].aws_cloudwatch_log_group.this[0]
```
**📖 Reads**

```tf
module.service.data.aws_iam_policy_document.s3_policy
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.data.aws_iam_policy_document.s3_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::vol-app-assets/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.service.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_lb_listener_rule.this["api"] will be created
  + resource "aws_lb_listener_rule" "this" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:listener/app/DEVAPPQA-OLCS-PRI-SVCS-ALB/b21df94bee7afbcc/079795fb21af88e7"
      + priority     = 10
      + tags_all     = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "api.*",
                ]
            }
        }
    }

  # module.service.aws_lb_listener_rule.this["internal"] will be created
  + resource "aws_lb_listener_rule" "this" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:listener/app/DEVAPPQA-OLCS-PRI-IUWEB-ALB/5d7b89e0d93d5b1e/4c6cdab6c475f605"
      + priority     = 10
      + tags_all     = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "iuweb.*",
                ]
            }
        }
    }

  # module.service.aws_lb_listener_rule.this["selfserve"] will be created
  + resource "aws_lb_listener_rule" "this" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:listener/app/DEVAPPQA-OLCS-PRI-SSWEB-ALB/becaba98d0276fd3/b92208df7025b367"
      + priority     = 10
      + tags_all     = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "ssweb.*",
                ]
            }
        }
    }

  # module.service.aws_lb_target_group.this["api"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "vol-app-int-api-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-ee79348b"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 300
          + matcher             = "200-499"
          + path                = "/healthcheck"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = 60
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.service.aws_lb_target_group.this["internal"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "vol-app-int-internal-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-ee79348b"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 300
          + matcher             = "200-499"
          + path                = "/healthcheck"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = 60
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.service.aws_lb_target_group.this["selfserve"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "vol-app-int-selfserve-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-ee79348b"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 300
          + matcher             = "200-499"
          + path                = "/healthcheck"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = 60
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.service.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = "vol-app-assets"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.service.module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "cdn.qa.olcs.dev-dvsacloud.uk"
      + domain_validation_options = [
          + {
              + domain_name           = "cdn.qa.olcs.dev-dvsacloud.uk"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "cdn.qa.olcs.dev-dvsacloud.uk",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.service.module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)

      + timeouts {}
    }

  # module.service.module.batch.aws_batch_compute_environment.this["fargate"] will be created
  + resource "aws_batch_compute_environment" "this" {
      + arn                             = (known after apply)
      + compute_environment_name        = (known after apply)
      + compute_environment_name_prefix = "vol-app-int-fargate-"
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = (known after apply)
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags_all                        = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                            = "MANAGED"

      + compute_resources {
          + desired_vcpus      = (known after apply)
          + max_vcpus          = 4
          + security_group_ids = [
              + "sg-2f750f4b",
            ]
          + subnets            = [
              + "subnet-00b91bd370a33942a",
              + "subnet-048665692f64a84cf",
              + "subnet-07999dfac12a45d8a",
            ]
          + type               = "FARGATE"

          + ec2_configuration (known after apply)
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-cancel-unsubmitted-bilateral"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-ch-vs-olcs-diffs"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-clean-up-variations"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-close-expired-windows"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-cns"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-company-profile-dlq"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 900
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-create-psv-licence-surrender-task"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-data-retention-delete"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-data-retention-populate"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-data-retention-postcheck"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-data-retention-precheck"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-database-maintenance"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-digital-continuation-reminders"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-duplicate-vehicle-warning"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-enqueue-ch-compare"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 1800
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-expire-bus-registration"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-flag-urgent-tasks"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 1800
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-import-users-from-csv"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-inspection-request-email"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 1800
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-interim-end-date-enforcement"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-international-goods-export"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-last-tm-letter"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-licence-status-rules"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 1800
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-mark-expired-permits"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-cl"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-company-profile"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 150
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-inbox"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-insolvency"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 900
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-insolvency-dlq"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 900
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-ntu"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-ntu"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-queue-community-licences"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 90
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-queue-disc-generation"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 90
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-queue-disc-print"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 850
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-queue-ecmt-accept"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 90
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-general"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-queue-general"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 90
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-queue-irhp-allocate"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 90
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-queue-permit-generation"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 90
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-queue-permit-print"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 850
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-print"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-process-queue-print"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 90
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-psv-operator-list-export"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-remove-read-audit"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 43200
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["resolve-payments"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 =... (truncated, see full plan in the workflow run logs)
```

</details>